Config.org
#+TITLE: E6's GNU Emacs Config
#+AUTHOR: Elihu SoNy (Ehesh)
#+DESCRIPTION: DT's personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:3

After years of trying to use emacs and failing, part of which is that I could not get the nag of it, the other part that I would get very frustrated as it did not work so good with windows, I am trying once more to find my way here. This is my config. I have always hessitated to all myself a programmer. Instead, I am more of a tinkerer, and this is my current playground. This is my frankenstein of a config taken from here and there. Some are just direct copy and paste from the repos. The base is made by Derek Taylor's config that was then absorbed to the Xero Linux distro configurations. From there I ran into Minimal Emacs on Reddit and thought about implementing it. Gotta say, I feel quite proud of myself for getting this far. I have also taken portions Kristoffer Balintona's articles chi-xigua's PovertEmacs. I also wanted to implement Marie-Hélène Burle's suggestion's on a youtube video from WestDRI.  


DT's gitlab repo: https://gitlab.com/dwt1/dotfiles
Xero Linux: https://github.com/xerolinux/eMacs-Config
Minimal Emacs: https://github.com/jamescherti/minimal-emacs.d
Kristoffer Balintona: https://kristofferbalintona.me/
Marie-Hélène Burle: https://www.youtube.com/watch?v=SOxlQ7ogplA&t
PovertEmacs: https://codeberg.org/chi-xigua/PovertEmacs#headline-79




TODO at some point I need to document the packages better so they link to their own repo's and comment things arround.



* Table of contents :toc:
- [[#auto-tangle-configuration][Auto-Tangle Configuration]]
- [[#pre-early-init-configuration][Pre-Early-Init Configuration]]
  - [[#custom-variables][Custom Variables]]
  - [[#custom-set-faces][Custom set faces]]
  - [[#emacs-folder][Emacs Folder]]
  - [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#qos][QOS]]
  - [[#enable-prettify-symbols-mode][Enable prettify symbols mode]]
  - [[#all-the-icons][ALL THE ICONS]]
  - [[#sane-defaults][SANE DEFAULTS]]
  - [[#backup][BACKUP]]
- [[#post-early-init-configuration][Post-Early-Init Configuration]]
  - [[#theme][THEME]]
  - [[#diminish][DIMINISH]]
  - [[#transparency][TRANSPARENCY]]
  - [[#general-keybindings][GENERAL KEYBINDINGS]]
  - [[#meow][Meow]]
  - [[#minibuffer-escape][MINIBUFFER ESCAPE]]
- [[#pre-init-configuration][Pre-Init Configuration]]
  - [[#fonts][FONTS]]
  - [[#vertico][Vertico]]
  - [[#orderless][Orderless]]
  - [[#consult][Consult]]
  - [[#marginalia][Marginalia]]
  - [[#embark][Embark]]
  - [[#corfu][Corfu]]
  - [[#cape-todo-the-bind-map][Cape TODO the bind map]]
  - [[#which-key][WHICH-KEY]]
- [[#post-init-configuration][Post-Init Configuration]]
  - [[#dashboard][DASHBOARD]]
  - [[#dired][DIRED]]
  - [[#drag-stuff][DRAG-STUFF]]
  - [[#ediff][EDIFF]]
  - [[#elfeed][ELFEED]]
  - [[#eradio][ERADIO]]
  - [[#flycheck][FLYCHECK]]
  - [[#flyspell][FLYSPELL]]
  - [[#dictionary--thesaurus][Dictionary + Thesaurus]]
  - [[#undo-tree][UNDO TREE]]
  - [[#git-programs][GIT PROGRAMS]]
  - [[#highlight-todo][HIGHLIGHT TODO]]
  - [[#language-support][LANGUAGE SUPPORT]]
  - [[#neotree][NEOTREE]]
  - [[#org-mode][ORG MODE]]
  - [[#write-good-mode][Write Good Mode]]
  - [[#pdfs][PDFs]]
  - [[#perspective][PERSPECTIVE]]
  - [[#projectile][PROJECTILE]]
  - [[#rainbow-delimiters][RAINBOW DELIMITERS]]
  - [[#rainbow-mode][RAINBOW MODE]]
  - [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#sudo-edit][Sudo EDIT]]
  - [[#tldr][TLDR]]
  - [[#transient][TRANSIENT]]
  - [[#moody][MOODY]]
- [[#post-hooks][Post hooks]]
  - [[#test][TEST]]

* Auto-Tangle Configuration
  Automatically tangle this config file on save.

#+BEGIN_SRC emacs-lisp
(defun org-babel-tangle-on-save ()
  "Tangle the current Org file if `org-babel-tangle` is enabled."
  (when (string= (file-name-extension (buffer-file-name)) "org")
    (org-babel-tangle)))

(add-hook 'org-mode-hook
          (lambda () (add-hook 'before-save-hook #'org-babel-tangle-on-save nil 'local)))
#+END_SRC

* Pre-Early-Init Configuration
  This section will generate the `pre-early-init.el` file.
all source blocs must include  ~:tangle ~/.emacs.d/pre-early-init.el~

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
  ;;; pre-early-init.el --- Early configurations -*- no-byte-compile: t; lexical-binding: t; -*-
#+end_src


** Custom Variables 
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   '("02f57ef0a20b7f61adce51445b68b2a7e832648ce2e7efb19d217b6454c1b644" "6945dadc749ac5cbd47012cad836f92aea9ebec9f504d32fe89a956260773ca4" "944d52450c57b7cbba08f9b3d08095eb7a5541b0ecfb3a0a9ecd4a18f3c28948" "636b135e4b7c86ac41375da39ade929e2bd6439de8901f53f88fde7dd5ac3561" "1f669e8abe4dc2855268c9a607b5e350e2811b3c5afd09af5939ff0c01a89c5a" default))
 '(package-selected-packages
   '(doom-modeline ivy-rich all-the-icons-ivy-rich flycheck dashboard all-the-icons))
 '(send-mail-function 'smtpmail-send-it)
 '(smtpmail-smtp-server "smtp.1and1.com")
 '(smtpmail-smtp-service 587))

#+end_src
** Custom set faces
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
;; (custom-set-faces
;;  ;; custom-set-faces was added by Custom.
;;  ;; If you edit it by hand, you could mess it up, so be careful.
;;  ;; Your init file should contain only one such instance.
;;  ;; If there is more than one, they won't work right.
;;  '(org-level-1 ((t (:inherit outline-1 :height 1.7))))
;;  '(org-level-2 ((t (:inherit outline-2 :height 1.6))))
;;  '(org-level-3 ((t (:inherit outline-3 :height 1.5))))
;;  '(org-level-4 ((t (:inherit outline-4 :height 1.4))))
;;  '(org-level-5 ((t (:inherit outline-5 :height 1.3))))
;;  '(org-level-6 ((t (:inherit outline-5 :height 1.2))))
;;  '(org-level-7 ((t (:inherit outline-5 :height 1.1)))))
#+end_src
 
** Emacs Folder

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
(setq default-directory "G:/Other computers/Lenny/Documents/Story-Weaver")
#+end_src

** IMPORTANT PROGRAMS TO LOAD FIRST
To keep this =config.org= a reasonable length, I have moved a lot of code to individual scripts that will be sourced by this config.  These scripts are found in "~/.emacs.d/scripts" and do not contain any code that most people are likely to need to edit.

*** Adding the scripts directory to path
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
(add-to-list 'load-path "~/.emacs.d/var/scripts/")
#+end_src

*** Sourcing the scripts
#+begin_src emacs-lisp  :tangle ~/.emacs.d/pre-early-init.el

(require 'elpaca-setup)  ;; The Elpaca Package Manager
(require 'buffer-move)   ;; Buffer-move for better window management
(require 'app-launchers) ;; Use emacs as a run launcher like dmenu (experimental)
#+end_src

** QOS
*** Declutter
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
;; Reducing clutter in ~/.emacs.d by redirecting files to ~/emacs.d/var/
(setq minimal-emacs-var-dir (expand-file-name "var/" minimal-emacs-user-directory))
;;(setq package-user-dir (expand-file-name "elpa" minimal-emacs-var-dir))
;;(setq package-user-dir (expand-file-name "elpaca" minimal-emacs-var-dir))
(setq user-emacs-directory minimal-emacs-var-dir)
#+end_src

** Enable prettify symbols mode
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
  (global-prettify-symbols-mode t)
#+END_SRC


** ALL THE ICONS
This is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
  
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src



*** Zooming In/Out
You can use the bindings CTRL plus =/- for zooming in/out.  You can also use CTRL plus the mouse wheel for zooming in/out.

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** SANE DEFAULTS
The following settings are simple modes that are enabled (or disabled) so that Emacs functions more like you would expect a proper editor/IDE to function.

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-early-init.el

(delete-selection-mode 1)    ;; You can select text and delete it by typing.
(electric-indent-mode -1)    ;; Turn off the weird indenting that Emacs does by default.
(electric-pair-mode 1)       ;; Turns on automatic parens pairing
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
(global-auto-revert-mode t)  ;; Automatically show changes if the file has changed
(global-display-line-numbers-mode 1) ;; Display line numbers
(global-visual-line-mode t)  ;; Enable truncated lines
(menu-bar-mode -1)           ;; Disable the menu bar 
(scroll-bar-mode -1)         ;; Disable the scroll bar
(tool-bar-mode -1)           ;; Disable the tool bar
(setq org-edit-src-content-indentation 0) ;; Set src block automatic indent to 0 instead of 2.
(setq use-file-dialog nil)   ;; No file dialog
(setq use-dialog-box nil)    ;; No dialog box
(setq pop-up-windows nil)    ;; No popup windows
#+end_src


** BACKUP 
By default, Emacs creates automatic backups of files in their original directories, such "file.el" and the backup "file.el~".  This leads to a lot of clutter, so let's tell Emacs to put all backups that it creates in the =TRASH= directory.

#+begin_src emacs-lisp  :tangle ~/.emacs.d/pre-early-init.el
(setq backup-directory-alist '((".*" . "~/.local/share/Trash/files")))
#+end_src


* Post-Early-Init Configuration
  This section will generate the `post-early-init.el` file.
all source blocs must include  ~:tangle ~/.emacs.d/post-early-init.el~


#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el
  ;;; post-early-init.el --- Early configurations -*- no-byte-compile: t; lexical-binding: t; -*-
#+end_src







