Config.org
** THEME

I have changed the themes to modus. I really liked Doom-one that wa set up before and I might at somepoint create my custom Modus with that color scheme. But as modus is starting in version 28, I thought I keep stuff in house a bit.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el



(use-package modus-themes
  ;; :load-path "~/.emacs.d/src/modus-themes"
  :ensure
  :demand
  :init
(setq modus-themes-mode-line '(accented borderless)
      modus-themes-bold-constructs t
      modus-themes-italic-constructs t
      modus-themes-fringes 'subtle
      modus-themes-tabs-accented t
      modus-themes-paren-match '(bold intense)
      modus-themes-prompts '(bold intense)
      modus-themes-completions       '((matches . (extrabold underline))
                                       (selection . (semibold italic)))
      modus-themes-org-blocks 'tinted-background
      modus-themes-scale-headings t
      modus-themes-region '(bg-only)
      modus-themes-headings
      '((1 . (rainbow overline background 1.4))
        (2 . (rainbow background 1.3))
        (3 . (rainbow bold 1.2))
        (t . (semilight 1.1))))

;; Load the deuteranopia theme by default
(load-theme 'modus-operandi-deuteranopia t)
(setq modus-themes-to-toggle '(modus-operandi-deuteranopia modus-vivendi-deuteranopia))

)



(define-key global-map (kbd "<f5>") #'modus-themes-toggle)



#+end_src


** DIMINISH
This package implements hiding or abbreviation of the modeline displays (lighters) of minor-modes.  With this package installed, you can add ':diminish' to any use-package block to hide that particular mode in the modeline.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el
(use-package diminish)
  (elpaca-wait)
#+end_src

** TRANSPARENCY
With Emacs version 29, true transparency has been added.  I have turned transparency off by setting the alpha to '100'.  If you want some slight transparency, try setting alpha to '90'.  Of course, if you set alpha to '0', the background of Emacs would completely transparent.


#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el
(add-to-list 'default-frame-alist '(alpha-background . 100)) ; For all new frames henceforth

#+end_src

