post-early-init.el
  ;;; post-early-init.el --- Early configurations -*- no-byte-compile: t; lexical-binding: t; -*-

(use-package modus-themes
  ;; :load-path "~/.emacs.d/src/modus-themes"
  :ensure
  :demand
  :init
(setq modus-themes-mode-line '(accented borderless)
      modus-themes-bold-constructs t
      modus-themes-italic-constructs t
      modus-themes-fringes 'subtle
      modus-themes-tabs-accented t
      modus-themes-paren-match '(bold intense)
      modus-themes-prompts '(bold intense)
      modus-themes-completions       '((matches . (extrabold underline))
                                       (selection . (semibold italic)))
      modus-themes-org-blocks 'tinted-background
      modus-themes-scale-headings t
      modus-themes-region '(bg-only)
      modus-themes-headings
      '((1 . (rainbow overline background 1.4))
        (2 . (rainbow background 1.3))
        (3 . (rainbow bold 1.2))
        (t . (semilight 1.1))))

;; Load the deuteranopia theme by default
(load-theme 'modus-operandi-deuteranopia t)
(setq modus-themes-to-toggle '(modus-operandi-deuteranopia modus-vivendi-deuteranopia))

)



(define-key global-map (kbd "<f5>") #'modus-themes-toggle)

(use-package diminish)
  (elpaca-wait)

(add-to-list 'default-frame-alist '(alpha-background . 100)) ; For all new frames henceforth
