Config.org
** Meow
=meow= Meow is yet another modal editing mode for Emacs.

Meow aims to blend modal editing into Emacs with minimal interference with its original key-bindings, avoiding most of the hassle introduced by key-binding conflicts. This leads to lower necessary configuration and better integration. More is achieved with fewer commands to remember. lightly inspired in helix's [[https://eugenesvk.github.io/kbdHelix/modifew/#m-normal][modifew]]
 
#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el

(define-key minibuffer-local-map (kbd "C-i") 'next-line)
(define-key minibuffer-local-map (kbd "C-k") 'next-line)

(defun meow-setup ()
    (meow-motion-overwrite-define-key
     '("j" . meow-next) 
     '("k" . meow-prev) 
     '("SPC" . my-transient-menu)
     '("<escape>" . ignore))

    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
;;     '("SPC" . my-transient-menu)
     '("j" . "H-j")
     '("k" . "H-k")
;;     '("SPC" . e6-meow-leader)
;;      ;; --- File Navigation ---
;;      '("." . find-file) 
;;      '("=" . perspective-map)
;;      ;; --- Editing ---
;;      '("TAB" . comment-line)
;;      '("u" . universal-argument)
;;      ;; Use SPC (0-9) for digit arguments.
;;      '("1" . meow-digit-argument)
;;      '("2" . meow-digit-argument)
;;      '("3" . meow-digit-argument)
;;      '("4" . meow-digit-argument)
;;      '("5" . meow-digit-argument)
;;      '("6" . meow-digit-argument)
;;      '("7" . meow-digit-argument)
;;      '("8" . meow-digit-argument)
;;      '("9" . meow-digit-argument)
;;      '("0" . meow-digit-argument)
;;      ;; --- Meow Help ---
;;      '("/" . meow-keypad-describe-key)
;;      '("?" . meow-cheatsheet)
;; 
;;      ;; --- Transient Menu Example (Buffers) ---
;;      '("b" . e6-buffer-menu)
     )
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . execute-extended-command)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . kill-ring-save)
    ;; '("d" . meow-delete)
    ;; '("D" . meow-backward-delete)
     '("e" . meow-append)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-backward-delete)
     '("H" . meow-delete)
     '("i" . meow-prev)
     '("I" . meow-open-above)
     '("j" . meow-back-word)
     '("J" . meow-back-expand)
     '("k" . meow-next)
     '("K" . meow-open-below)
     '("l" . meow-next-word)
     '("L" . meow-expand-next-word)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-inner-of-thing)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-grab)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . clipboard-yank)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-kill)
     '("X" . meow-goto-line)
     '("y" . undo-redo)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)
     '("SPC" . my-transient-menu)
))




#+end_src


#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el
  (use-package meow
 
  :ensure t
  :config
  ;; set colors in theme
  (setq meow-use-dynamic-face-color nil)
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (setq meow-keypad-leader-dispatch nil) 
  
;;;; Cool cursor stuffs
;; (defun meow--update-cursor-custom ()
;;   (progn
;;     (meow--set-cursor-type 'hollow)
;;     (meow--set-cursor-color 'meow-insert-cursor)))
;; (add-to-list 'meow-update-cursor-functions-alist
;;              '((lambda () (and (meow-insert-mode-p)
;;                                (eq major-mode 'org-mode)))
;;                . meow--update-cursor-custom))

  (meow-setup)
  (meow-global-mode 1)) 

#+end_src


** MINIBUFFER ESCAPE
By default, Emacs requires you to hit ESC three times to escape quit the minibuffer.  

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-early-init.el
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src
* Pre-Init Configuration


  This section will generate the `pre-init.el` file.
all source blocs must include  ~:tangle ~/.emacs.d/pre-init.el~

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el
  ;;; pre-init.el --- Early configurations -*- no-byte-compile: t; lexical-binding: t; -*-
#+end_src

** FONTS
 


Defining the various fonts that Emacs will use.

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el

(use-package nerd-icons)


(use-package fontaine
  :ensure t
  :custom
  (fontaine-presets
   '((regular
      :default-family "FiraCode Nerd Font"
      :default-weight medium
      :default-height 110
      :fixed-pitch-family "FiraCode Nerd Font"
      :fixed-pitch-weight nil ; falls back to :default-weight
      :fixed-pitch-height 1.0
      :variable-pitch-family "Gentium Plus"
      :variable-pitch-weight normal
      :variable-pitch-height 1.2
      :line-spacing 1)
     (large
      :inherit regular
      :default-height 175
      :variable-pitch-height 1.3)))
  :config
  (fontaine-set-preset 'regular))

#+end_src

** Vertico
[[https://github.com/minad/vertico][Vertico]] provides a performant and minimalistic vertical completion UI based on the default completion system. The focus of Vertico is to provide a UI which behaves correctly under all circumstances.
 
#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el
(use-package vertico
  :ensure t
  :bind (:map vertico-map
         ("C-j" . vertico-next)
         ("C-k" . vertico-previous)
         ("C-f" . vertico-exit)
         :map minibuffer-local-map
         ("M-h" . backward-kill-word))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

#+end_src

** Orderless

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el
(use-package orderless
  :ensure t
  :custom
  (orderless-matching-styles
   '(orderless-literal
     orderless-prefixes
     orderless-initialism
     orderless-regexp
   ;; orderless-flex                       ; Basically fuzzy finding
   ;; orderless-strict-leading-initialism
   ;; orderless-strict-initialism
   ;; orderless-strict-full-initialism
   ;; orderless-without-literal          ; Recommended for dispatches instead
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))
   ))


#+end_src



** Consult

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el
(use-package consult
  :after vertico
  :ensure t
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"
)
#+end_src


** Marginalia

#+begin_src emacs-lisp :tangle ~/.emacs.d/pre-init.el
(use-package marginalia
  :after vertico
  :ensure t
;;   (:keymaps 'minibuffer-local-map
;;   "M-A" 'marginalia-cycle)
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))


(use-package all-the-icons-completion
  :ensure t
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))

#+end_src



