post-early-init.el

(define-key minibuffer-local-map (kbd "C-i") 'next-line)
(define-key minibuffer-local-map (kbd "C-k") 'next-line)

(defun meow-setup ()
    (meow-motion-overwrite-define-key
     '("j" . meow-next) 
     '("k" . meow-prev) 
     '("SPC" . my-transient-menu)
     '("<escape>" . ignore))

    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
;;     '("SPC" . my-transient-menu)
     '("j" . "H-j")
     '("k" . "H-k")
;;     '("SPC" . e6-meow-leader)
;;      ;; --- File Navigation ---
;;      '("." . find-file) 
;;      '("=" . perspective-map)
;;      ;; --- Editing ---
;;      '("TAB" . comment-line)
;;      '("u" . universal-argument)
;;      ;; Use SPC (0-9) for digit arguments.
;;      '("1" . meow-digit-argument)
;;      '("2" . meow-digit-argument)
;;      '("3" . meow-digit-argument)
;;      '("4" . meow-digit-argument)
;;      '("5" . meow-digit-argument)
;;      '("6" . meow-digit-argument)
;;      '("7" . meow-digit-argument)
;;      '("8" . meow-digit-argument)
;;      '("9" . meow-digit-argument)
;;      '("0" . meow-digit-argument)
;;      ;; --- Meow Help ---
;;      '("/" . meow-keypad-describe-key)
;;      '("?" . meow-cheatsheet)
;; 
;;      ;; --- Transient Menu Example (Buffers) ---
;;      '("b" . e6-buffer-menu)
     )
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . execute-extended-command)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . kill-ring-save)
    ;; '("d" . meow-delete)
    ;; '("D" . meow-backward-delete)
     '("e" . meow-append)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-backward-delete)
     '("H" . meow-delete)
     '("i" . meow-prev)
     '("I" . meow-open-above)
     '("j" . meow-back-word)
     '("J" . meow-back-expand)
     '("k" . meow-next)
     '("K" . meow-open-below)
     '("l" . meow-next-word)
     '("L" . meow-expand-next-word)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-inner-of-thing)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-grab)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . clipboard-yank)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-kill)
     '("X" . meow-goto-line)
     '("y" . undo-redo)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)
     '("SPC" . my-transient-menu)
))

  (use-package meow
 
  :ensure t
  :config
  ;; set colors in theme
  (setq meow-use-dynamic-face-color nil)
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (setq meow-keypad-leader-dispatch nil) 
  
;;;; Cool cursor stuffs
;; (defun meow--update-cursor-custom ()
;;   (progn
;;     (meow--set-cursor-type 'hollow)
;;     (meow--set-cursor-color 'meow-insert-cursor)))
;; (add-to-list 'meow-update-cursor-functions-alist
;;              '((lambda () (and (meow-insert-mode-p)
;;                                (eq major-mode 'org-mode)))
;;                . meow--update-cursor-custom))

  (meow-setup)
  (meow-global-mode 1))

(global-set-key [escape] 'keyboard-escape-quit)
