Config.org
*** Git Time Machine
[[https://github.com/emacsmirror/git-timemachine][git-timemachine]] is a program that allows you to move backwards and forwards through a file's commits.  'SPC g t' will open the time machine on a file if it is in a git repo.  Then, while in normal mode, you can use 'CTRL-j' and 'CTRL-k' to move backwards and forwards through the commits.


# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# (use-package git-timemachine
#   :after git-timemachine
#   :hook (evil-normalize-keymaps . git-timemachine-hook)
#   :config
#     (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
#     (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision)
# )
# #+end_src
# 
# *** Magit
# [[https://magit.vc/manual/][Magit]] is a full-featured git client for Emacs.
# 
# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# (use-package magit)
# 
# #+end_src

** HIGHLIGHT TODO
Adding highlights to TODO and related words.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package hl-todo
  :hook ((org-mode . hl-todo-mode)
         (prog-mode . hl-todo-mode))
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(("TODO"       warning bold)
          ("FIXME"      error bold)
          ("HACK"       font-lock-constant-face bold)
          ("REVIEW"     font-lock-keyword-face bold)
          ("NOTE"       success bold)
          ("DEPRECATED" font-lock-doc-face bold))))

#+end_src


** LANGUAGE SUPPORT
Emacs has built-in programming language modes for Lisp, Scheme, DSSSL, Ada, ASM, AWK, C, C++, Fortran, Icon, IDL (CORBA), IDLWAVE, Java, Javascript, M4, Makefiles, Metafont, Modula2, Object Pascal, Objective-C, Octave, Pascal, Perl, Pike, PostScript, Prolog, Python, Ruby, Simula, SQL, Tcl, Verilog, and VHDL.  Other languages will require you to install additional modes.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
;;(use-package dart-mode)
;;(use-package haskell-mode)
;;(use-package lua-mode)
;;(use-package php-mode)

#+end_src


** NEOTREE
Neotree is a file tree viewer.  When you open neotree, it jumps to the current file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the neotree width be adjustable.  NeoTree provides following themes: classic, ascii, arrow, icons, and nerd.  Theme can be config'd by setting "two" themes for neo-
theme: one for the GUI and one for the terminal.  I like to use 'SPC t' for 'toggle' keybindings, so I have used 'SPC t n' for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package neotree
  :config
  (setq neo-smart-open t
        neo-show-hidden-files t
        neo-window-width 55
        neo-window-fixed-size nil
        inhibit-compacting-font-caches t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))

#+end_src

** ORG MODE
*** Diminish Org Indent Mode
Removes "Ind" from showing in the modeline.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(eval-after-load 'org-indent '(diminish 'org-indent-mode))

#+end_src

*** Org-Tempo
Org-tempo is not a separate package but a module within org that can be enabled.  Org-tempo allows for '<s' followed by TAB to expand to a begin_src tag.  Other expansions available include:

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el 
(require 'org-tempo)
#+end_src

*** Preserve Indentation On Org-Babel-Tangle
#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(setq org-src-preserve-indentation t)

#+end_src

*** Toc-Org
Allows us to create a Table of Contents in our Org docs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src
 
*** Org customizations
# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# 
# (use-package org
#   :custom
#   (org-startup-indented t)
#   (org-hide-emphasis-markers t)
#   (org-startup-with-inline-images t)
#   (org-image-actual-width '(450))
#   (org-fold-catch-invisible-edits 'error)
#   (org-pretty-entities t)
#   (org-use-sub-superscripts "{}")
#   (org-id-link-to-org-use-id t)
#   (org-fold-catch-invisible-edits 'show))
 #+end_src

*** ORG-MODERN

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el


(use-package org-modern
  ;; :custom
  ;; (org-modern-keyword nil)
  ;; (org-modern-checkbox nil)
  ;; (org-modern-table nil)
  :config
  (setq
    ;; Edit settings

    org-auto-align-tags nil
    org-tags-column 0
    org-catch-invisible-edits 'show-and-error
    org-insert-heading-respect-content t
  
    org-modern-star 'replace

  ;;   org-hide-emphasis-markers t
  ;;  org-pretty-entities t

    ;; Agenda styling
    org-agenda-tags-column 0
    org-agenda-block-separator ?─
    org-agenda-time-grid
    '((daily today require-timed)
      (800 1000 1200 1400 1600 1800 2000)
      " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
    org-agenda-current-time-string
    "◀── now ─────────────────────────────────────────────────")

    ;; Ellipsis styling
    (setq org-ellipsis "…")
    (set-face-attribute 'org-ellipsis nil :inherit 'default :box nil)
    (global-org-modern-mode))




(use-package org-modern-indent
  :ensure (org-modern-indent :host github :repo "jdtsmith/org-modern-indent")
  :hook (org-mode . org-modern-indent-mode)
 )
    
#+end_src

*** ORG-MENU

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el

(elpaca
  '(org-menu
    :host github
    :repo "sheijk/org-menu"))
#+end_src

*** ORG-APPEAR

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el

(use-package org-appear
 :after org
 :hook (org-mode-hook . org-appear-mode))

#+end_src

** Write Good Mode
#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el

(use-package writegood-mode
  ;; :bind
 ;; (("C-c w s r" . writegood-reading-ease)
 ;;  ("C-c w s l" . writegood-grade-level))
  ;; :hook
  ;; (text-mode . writegood-mode)
)
#+end_src

** PDFs
[[https://github.com/vedang/pdf-tools][pdf-tools]] is a replacement of DocView for viewing PDF files inside Emacs.  It uses the =poppler= library, which also means that 'pdf-tools' can by used to modify PDFs.  I use to disable 'display-line-numbers-mode' in 'pdf-view-mode' because line numbers crash it.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package pdf-tools
  :defer t
  :commands (pdf-loader-install)
  :mode "\\.pdf\\'"
  ;; :bind (: pdf-view-mode-map
  ;;             ("j" . pdf-view-next-line-or-next-page)
  ;;             ("k" . pdf-view-previous-line-or-previous-page)
  ;;             ("C-=" . pdf-view-enlarge)
  ;;             ("C--" . pdf-view-shrink))
  :init (pdf-loader-install)
  :config (add-to-list 'revert-without-query ".pdf"))

(add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1)
             (blink-cursor-mode -1)
             (doom-modeline-mode -1)))
#+end_src

** PERSPECTIVE
[[https://github.com/nex3/perspective-el][Perspective]] provides multiple named workspaces (or "perspectives") in Emacs, similar to multiple desktops in window managers.  Each perspective has its own buffer list and its own window layout, along with some other isolated niceties, like the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Xref.html][xref]] ring.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package perspective
  :custom
  ;; NOTE! I have also set 'SCP =' to open the perspective menu.
  ;; I'm only setting the additional binding because setting it
  ;; helps suppress an annoying warning message.
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init 
  (persp-mode)
  :config
  ;; Sets a file to write to when we save states
  (setq persp-state-default-file "~/.emacs.d/sessions"))

;; This will group buffers by persp-name in ibuffer.
(add-hook 'ibuffer-hook
          (lambda ()
            (persp-ibuffer-set-filter-groups)
            (unless (eq ibuffer-sorting-mode 'alphabetic)
              (ibuffer-do-sort-by-alphabetic))))

;; Automatically save perspective states to file when Emacs exits.
(add-hook 'kill-emacs-hook #'persp-state-save)

#+end_src

** PROJECTILE
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs.  It should be noted that many projectile commands do not work if you have set "fish" as the "shell-file-name" for Emacs.  I had initially set "fish" as the "shell-file-name" in the Vterm section of this config, but oddly enough I changed it to "bin/sh" and projectile now works as expected, and Vterm still uses "fish" because my default user "sh" on my Linux system is "fish".

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package projectile
  :config
  (projectile-mode 1))
#+end_src

** RAINBOW DELIMITERS
Adding rainbow coloring to parentheses.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package rainbow-delimiters
  :hook ((emacs-lisp-mode . rainbow-delimiters-mode)
         (clojure-mode . rainbow-delimiters-mode)))

#+end_src

** RAINBOW MODE
Display the actual color as a background for any hex color value (ex. #ffffff).  The code block below enables rainbow-mode in all programming modes (prog-mode) as well as org-mode, which is why rainbow works in this document.  

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package rainbow-mode
  :diminish
  :hook org-mode prog-mode)
#+end_src


** SHELLS AND TERMINALS
In my configs, all of my shells (bash, fish, zsh and the ESHELL) require my shell-color-scripts-git package to be installed.  On Arch Linux, you can install it from the AUR.  Otherwise, go to my shell-color-scripts repository on GitLab to get it.

