Config.org
*** Eshell
Eshell is an Emacs 'shell' that is written in Elisp.

# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# (use-package eshell-toggle
#   :custom
#   (eshell-toggle-size-fraction 3)
#   (eshell-toggle-use-projectile-root t)
#   (eshell-toggle-run-command nil)
#   (eshell-toggle-init-function #'eshell-toggle-init-ansi-term))
# 
#   (use-package eshell-syntax-highlighting
#     :after esh-mode
#     :config
#     (eshell-syntax-highlighting-global-mode +1))
# 
#   ;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
#   ;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
#   ;; eshell-aliases-file -- sets an aliases file for the eshell.
# 
#   (setq eshell-rc-script (concat user-emacs-directory "var/eshell/profile")
#         eshell-aliases-file (concat user-emacs-directory "var/eshell/aliases")
#         eshell-history-size 5000
#         eshell-buffer-maximum-lines 5000
#         eshell-hist-ignoredups t
#         eshell-scroll-to-bottom-on-input t
#         eshell-destroy-buffer-when-process-dies t
#         eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
# #+end_src
# 
# *** Vterm
# Vterm is a terminal emulator within Emacs.  The 'shell-file-name' setting sets the shell to be used in M-x shell, M-x term, M-x ansi-term and M-x vterm.  By default, the shell is set to 'fish' but could change it to 'bash' or 'zsh' if you prefer.
# 
# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# (use-package vterm
# :config
# (setq shell-file-name "/bin/sh"
#       vterm-max-scrollback 5000))
# #+end_src
# 
# *** Vterm-Toggle 
# [[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the vterm buffer and whatever buffer you are editing.
# 
# #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
# (use-package vterm-toggle
#   :after vterm
#   :config
#   ;; When running programs in Vterm and in 'normal' mode, make sure that ESC
#   ;; kills the program as it would in most standard terminal programs.
#   (evil-define-key 'normal vterm-mode-map (kbd "<escape>") 'vterm--self-insert)
#   (setq vterm-toggle-fullscreen-p nil)
#   (setq vterm-toggle-scope 'project)
#   (add-to-list 'display-buffer-alist
#                '((lambda (buffer-or-name _)
#                      (let ((buffer (get-buffer buffer-or-name)))
#                        (with-current-buffer buffer
#                          (or (equal major-mode 'vterm-mode)
#                              (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
#                   (display-buffer-reuse-window display-buffer-at-bottom)
#                   ;;(display-buffer-reuse-window display-buffer-in-direction)
#                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
#                   ;;(direction . bottom)
#                   ;;(dedicated . t) ;dedicated is supported in emacs27
#                   (reusable-frames . visible)
#                   (window-height . 0.4))))
# 
# #+end_src

** Sudo EDIT
[[https://github.com/nflath/sudo-edit][sudo-edit]] gives us the ability to open files with sudo privileges or switch over to editing with sudo privileges if we initially opened the file without such privileges.

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package sudo-edit)
#+end_src

** TLDR

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(use-package tldr)

#+end_src


** TRANSIENT
#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el

;; Now you can use use-package to install and configure packages


(use-package transient)       
   
(elpaca-wait)
 
(transient-define-prefix my-transient-menu ()
  "A sample transient menu."
  [["Basic Commands"
    ("SPC" "consult-outl" (lambda () (interactive) (consult-outline)))
    ("o" "org-menu" (lambda () (interactive) (org-menu)))]
   ["Other Commands"
      ("TAB" "next window" next-window-any-frame)
    ("y" "Action Y" (lambda () (interactive) (message "Action Y executed!")))]
   ["Exit"
    ("<escape>" "" transient-quit-one)]])
#+end_src

** MOODY

 #+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el

;; Define the function to change the modeline color based on the meow state
(defun my-update-modeline-color-based-on-meow-state ()
  "Update the moody modeline color based on the state of Meow."
  (let ((insert-state-color  (modus-themes-get-color-value 'bg-sage))  ;; Green color for insert mode
        ;; Use modus theme aliases for the modeline in normal state
        (normal-state-color (modus-themes-get-color-value 'bg-mode-line-active)))
    (if (meow-insert-mode-p)
        ;; Change to green in insert mode
        (set-face-attribute 'mode-line nil :background insert-state-color)
      ;; Revert to the original alias from the Modus theme
      (set-face-attribute 'mode-line nil :background normal-state-color))))

;; Add the function to the meow state change hooks
(add-hook 'meow-insert-enter-hook #'my-update-modeline-color-based-on-meow-state)
(add-hook 'meow-insert-exit-hook #'my-update-modeline-color-based-on-meow-state)

;; Optionally hook into normal mode to ensure the color is reset there too
(add-hook 'meow-normal-enter-hook #'my-update-modeline-color-based-on-meow-state)

(use-package moody
  :config
  (moody-replace-mode-line-front-space)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode))

(use-package minions
:config
	(setq minions-mode-line-lighter ""
				minions-mode-line-delimiters '("" . ""))
 (minions-mode 1))

#+end_src


* Post hooks

#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
;; Auto-revert in Emacs is a feature that automatically updates the
;; contents of a buffer to reflect changes made to the underlying file
;; on disk.
(add-hook 'after-init-hook #'global-auto-revert-mode)

;; recentf is an Emacs package that maintains a list of recently
;; accessed files, making it easier to reopen files you have worked on
;; recently.
(add-hook 'after-init-hook #'recentf-mode)

;; savehist is an Emacs feature that preserves the minibuffer history between
;; sessions. It saves the history of inputs in the minibuffer, such as commands,
;; search strings, and other prompts, to a file. This allows users to retain
;; their minibuffer history across Emacs restarts.
(add-hook 'after-init-hook #'savehist-mode)

;; save-place-mode enables Emacs to remember the last location within a file
;; upon reopening. This feature is particularly beneficial for resuming work at
;; the precise point where you previously left off.
(add-hook 'after-init-hook #'save-place-mode)
#+end_src

** TEST
#+begin_src emacs-lisp :tangle ~/.emacs.d/post-init.el
(defun reader ()
  (interactive)
  (let ((choices '(("First"  . "Hi!")
                   ("Second" . 'second-choice)
                   ("Third"  . 'third-choice))))
    (alist-get
     (completing-read "Choose: " choices)
     choices nil nil 'message)))

(defun github-code-search ()
  "Search code on github for a given language."
  (interactive)
  (let ((language (completing-read
                   "Language: "
                   '("Emacs Lisp" "Python"  "Clojure" "R")))
        (code (read-string "Code: ")))
    (browse-url
     (concat "https://github.com/search?l=" language
             "&type=code&q=" code))))
  
(defun dm-search ()
  "Search various search engines."
  (interactive)
  (let ((engine (completing-read
                 "Search Engine: "
                 '("Arch Wiki" 
                   "Bing"
                   "Google"
                   "Wikipedia")))
        (query (read-string "Query: ")))
    (if (equal engine "Google")
      (browse-url
       (concat "https://www.google.com/search?q=" query)))))

(defun dt/key-value-completing (choice)                                     
  (interactive
   (list
    (let ((completions '(("1" "One") 
                         ("2" "Two")
                         ("3" "Three"))))              
      (cadr (assoc (completing-read "Choose: " completions) completions)))))
  (message "You choose `%s'" choice))

#+end_src
