post-init.el

(use-package sudo-edit)

(use-package tldr)

;; Now you can use use-package to install and configure packages


(use-package transient)       
   
(elpaca-wait)
 
(transient-define-prefix my-transient-menu ()
  "A sample transient menu."
  [["Basic Commands"
    ("SPC" "consult-outl" (lambda () (interactive) (consult-outline)))
    ("o" "org-menu" (lambda () (interactive) (org-menu)))]
   ["Other Commands"
      ("TAB" "next window" next-window-any-frame)
    ("y" "Action Y" (lambda () (interactive) (message "Action Y executed!")))]
   ["Exit"
    ("<escape>" "" transient-quit-one)]])

;; Define the function to change the modeline color based on the meow state
(defun my-update-modeline-color-based-on-meow-state ()
  "Update the moody modeline color based on the state of Meow."
  (let ((insert-state-color  (modus-themes-get-color-value 'bg-sage))  ;; Green color for insert mode
        ;; Use modus theme aliases for the modeline in normal state
        (normal-state-color (modus-themes-get-color-value 'bg-mode-line-active)))
    (if (meow-insert-mode-p)
        ;; Change to green in insert mode
        (set-face-attribute 'mode-line nil :background insert-state-color)
      ;; Revert to the original alias from the Modus theme
      (set-face-attribute 'mode-line nil :background normal-state-color))))

;; Add the function to the meow state change hooks
(add-hook 'meow-insert-enter-hook #'my-update-modeline-color-based-on-meow-state)
(add-hook 'meow-insert-exit-hook #'my-update-modeline-color-based-on-meow-state)

;; Optionally hook into normal mode to ensure the color is reset there too
(add-hook 'meow-normal-enter-hook #'my-update-modeline-color-based-on-meow-state)

(use-package moody
  :config
  (moody-replace-mode-line-front-space)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode))

(use-package minions
:config
	(setq minions-mode-line-lighter ""
				minions-mode-line-delimiters '("" . ""))
 (minions-mode 1))

;; Auto-revert in Emacs is a feature that automatically updates the
;; contents of a buffer to reflect changes made to the underlying file
;; on disk.
(add-hook 'after-init-hook #'global-auto-revert-mode)

;; recentf is an Emacs package that maintains a list of recently
;; accessed files, making it easier to reopen files you have worked on
;; recently.
(add-hook 'after-init-hook #'recentf-mode)

;; savehist is an Emacs feature that preserves the minibuffer history between
;; sessions. It saves the history of inputs in the minibuffer, such as commands,
;; search strings, and other prompts, to a file. This allows users to retain
;; their minibuffer history across Emacs restarts.
(add-hook 'after-init-hook #'savehist-mode)

;; save-place-mode enables Emacs to remember the last location within a file
;; upon reopening. This feature is particularly beneficial for resuming work at
;; the precise point where you previously left off.
(add-hook 'after-init-hook #'save-place-mode)

(defun reader ()
  (interactive)
  (let ((choices '(("First"  . "Hi!")
                   ("Second" . 'second-choice)
                   ("Third"  . 'third-choice))))
    (alist-get
     (completing-read "Choose: " choices)
     choices nil nil 'message)))

(defun github-code-search ()
  "Search code on github for a given language."
  (interactive)
  (let ((language (completing-read
                   "Language: "
                   '("Emacs Lisp" "Python"  "Clojure" "R")))
        (code (read-string "Code: ")))
    (browse-url
     (concat "https://github.com/search?l=" language
             "&type=code&q=" code))))
  
(defun dm-search ()
  "Search various search engines."
  (interactive)
  (let ((engine (completing-read
                 "Search Engine: "
                 '("Arch Wiki" 
                   "Bing"
                   "Google"
                   "Wikipedia")))
        (query (read-string "Query: ")))
    (if (equal engine "Google")
      (browse-url
       (concat "https://www.google.com/search?q=" query)))))

(defun dt/key-value-completing (choice)                                     
  (interactive
   (list
    (let ((completions '(("1" "One") 
                         ("2" "Two")
                         ("3" "Three"))))              
      (cadr (assoc (completing-read "Choose: " completions) completions)))))
  (message "You choose `%s'" choice))
